---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.ClipPlane.Origin
zh: 原点
source: html/76ebf410-d2e1-c147-536c-5a615938e26d.htm
---
# Autodesk.Revit.DB.DirectContext3D.ClipPlane.Origin Property

**中文**: 原点

The plane's origin.

## Syntax (C#)
```csharp
public XYZ Origin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null